def move_zeros(lst):
    
    # создаем список для чисел, отличых от нуля
    num_list = []
    # создаем список для нулей
    zero_list = []
    # циклом разделяем элементы переданного списка по новым спискам: 0 и не 0
    for i in lst:
        if i != 0:
            num_list.append(i)
        
        else:
            zero_list.append(i)
    
    # объединяем два списка
    num_list.extend(zero_list)
    # меняем исходный список
    lst = num_list
    

    return lst


data = [
    [1, 2, 0, 1, 0, 1, 0, 3, 0, 1],
    [9, 0, 0, 9, 1, 2, 0, 1, 0, 1, 0, 3, 0, 1, 9, 0, 0, 0, 0, 9],
    [0, 0],
    [1, 9, 5, 4, 8, 2],
    []
]

test_data = [
    [1, 2, 1, 1, 3, 1, 0, 0, 0, 0],
    [9, 9, 1, 2, 1, 1, 3, 1, 9, 9, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    [0, 0],
    [1, 9, 5, 4, 8, 2],
    []
]


for i, d in enumerate(data):
    assert move_zeros(d) == test_data[i], f'С набором {d} есть ошибка, не проходит проверку'
    print(f'Тестовый набор {d} прошёл проверку')
print('Всё ок')